app/Controllers/Document.php

SELECT *
FROM `documents`
WHERE `from_id` = '41'
AND `to_id` = '41'
 LIMIT 40, 10
SELECT COUNT(*) AS `numrows`
FROM `documents`
WHERE `from_id` = '41'
AND `to_id` = '41'
---
            $document = $this->documentModel->filter(user_id(), user_id(), $sortBy, $sortFormat);
        }

        $data = [
            'title' => getenv('app.name') . ' | Dokumen Saya',
            // 'documents' => $this->documentModel->where('from_id', user_id())->where('to_id', user_id())->findAll()
            'documents' => $document->paginate(10, 'documents'),
            'pager' => $document->pager,
            'currentPage' => $currentPage
        ];