app/Controllers/Signature.php

    public function attemptSelfSign()
    {
        if ($this->request->getFile('document')->getError() == 4) {
            return redirect()->back()->with('error', 'File harus diupload');
        }

        $document = $this->request->getFile('document');
        $documentName = $document->getRandomName();

        if (!$this->documentModel->save(
            [
                'document_title' => $this->request->getPost('document_title'),
                'document_filename' => $documentName,
                'from_id' => user_id(),
                'to_id' => user_id()
            ]
        )) {
---
INSERT INTO `documents` (`document_title`, `document_filename`, `from_id`, `to_id`, `created_at`, `updated_at`) VALUES ('Laporan Kehadiran', '1655593663_b3b7840cef4e30c9f88a.pdf', '41', '41', '2022-06-19 06:07:43', '2022-06-19 06:07:43')